// スライダーに表示する画像のパス







// 画像とナビの要素を自動で追加
	// li要素を取得

	// li要素の中に画像タグを埋め込む

	// li要素をクラス名「slider-inner」の子要素として追加


	// li要素を取得

	// プロパティ「data-nav-index」に数値を割り振る

	// li要素をクラス名「nav」の子要素として追加




// スライドの数を取得(処理のために-1する)

// クラス名「imageSlide」に画像の1枚の要素を格納

// クラス名「dotNavigation」にドットナビの1つの要素を格納

// 「現在○○枚目のスライドを表示している」というインデックス番号を格納する変数

// 現在表示されている画像とドットナビにクラス名を付ける


// スライドがアニメーション中か判断するフラグ

// スライドのsetTimeoutを管理するタイマー

// スライド切り替え時に呼び出す関数


















// 左矢印のナビをクリックした時のイベント







// 右矢印のナビをクリックした時のイベント







// ドットナビをクリックした時のイベントを作成






